In [1]:
# Pandas mades it easy to turn a CSV into a dataframe, we just call read_csv()
# df = pd.read_csv('datasets/Admission_Predict.csv')
# df.head()

In [11]:
import pandas as pd
c = [{'name':'Tuba','age':23,'ID ': 321},
     {'name':'rakib','age':22,'ID ':543}
    ]
d = pd.DataFrame(c)
d

    name  age  ID
0   Tuba   23  321
1  rakib   22  543

In [10]:
d.columns

Index(['name', 'age'], dtype='object')

In [32]:
# In Pandas, we can use the rename() function It takes a
# parameter called columns, and we need to pass into a dictionary which the keys are the old column name and
# the value is the corresponding new column name

new=d.rename(columns={'name': 'NAME'})
new

    NAME  age  ID
0   Tuba   23  321
1  rakib   22  543

In [16]:
d #look the older dataframe is still the same

    name  age  ID
0   Tuba   23  321
1  rakib   22  543

In [31]:
new_2=d.rename(columns={'name': 'your name', 'ID':'your ID'})
new_2

  your name  age  ID
0      Tuba   23  321
1     rakib   22  543

In [18]:
# see the column ID has not been changed. because look carefully there is a space after ID. its not 'ID'. it is 'ID '
# let's try again

new=d.rename(columns={'name': 'your name', 'ID ':'your ID'})
new

  your name  age  your ID
0      Tuba   23      321
1     rakib   22      543

In [26]:
# So that works well, but it's a bit fragile. What if that was a tab instead of a space? Or two spaces?
# Another way is to create some function that does the cleaning and then tell renamed to apply that function
# across all of the data. Python comes with a handy string function to strip white space called "strip()".
# When we pass this in to rename we pass the function as the mapper parameter, and then indicate whether the
# axis should be columns or index (row labels)


new_df=d.rename(mapper=str.strip, axis='columns')
# Let's take a look at results
new_df.head()

#now see how it renames

a = new_df.rename(columns={'ID':'id'})
a

# look we hacent add space after ID here.

    name  age   id
0   Tuba   23  321
1  rakib   22  543

In [22]:
# df = pd.read_csv('datasets/Admission_Predict.csv', index_col=0) if we want to remove the index column(here it is o,1)

In [33]:
# With a list, you can use the list index to change a certain value or use list comprehension to change all of the values
# As an example, lets change all of the column names to lower case. First we need to get our list
cols = list(new.columns)
cols

['NAME', 'age', 'ID ']

In [34]:
# Then a little list comprehenshion

cols = [x.lower().strip() for x in cols]

# Then we just overwrite what is already in the .columns attribute
new.columns=cols

# And take a look at our results

new.head()

    name  age   id
0   Tuba   23  321
1  rakib   22  543